Theory/weuq-beam-coupling/Example/circularCylinder/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "100";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
64000
(
(0.00475652 -0.0116974 1.5532e-10)
(0.0084688 -0.0357719 1.57006e-10)
(0.0157539 -0.0584874 1.57138e-10)
(0.0262302 -0.0789838 1.55696e-10)
(0.0393418 -0.0965179 1.52618e-10)
(0.0543859 -0.11048 1.47593e-10)
(0.0705447 -0.120422 1.40595e-10)
(0.0869233 -0.126083 1.31706e-10)
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    cylinder
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    front
    {
        type            cyclic;
    }
    back
    {
        type            cyclic;
    }
}


// ************************************************************************* //
